#include "global.h"
#include "main.h"
#include "battle.h"
#include "bg.h"
#include "contest_effect.h"
#include "data.h"
#include "event_data.h"
#include "field_screen_effect.h"
#include "gpu_regs.h"
#include "move_relearner.h"
#include "list_menu.h"
#include "malloc.h"
#include "menu.h"
#include "menu_helpers.h"
#include "menu_specialized.h"
#include "overworld.h"
#include "palette.h"
#include "pokemon_summary_screen.h"
#include "script.h"
#include "sound.h"
#include "sprite.h"
#include "string_util.h"
#include "strings.h"
#include "task.h"
#include "constants/rgb.h"
#include "constants/songs.h"

#include "daycare.h"
#include "party_menu.h"

#include "rogue.h"
#include "rogue_controller.h"
#include "rogue_quest.h"
#include "rogue_questmenu.h"

/*
 * Move relearner state machine
 * ------------------------
 *
 * Entry point: TeachQuestMenuMove
 *
 * TeachQuestMenuMove
 * Task_WaitForFadeOut
 * CB2_InitQuestMenu
 *   - Creates moveDisplayArrowTask to listen to right/left buttons.
 *   - Creates moveListScrollArrowTask to listen to up/down buttons.
 *   - Whenever the selected move changes (and once on init), the QuestMenuCursorCallback
 *     is called (see sQuestMenuMovesListTemplate). That callback will reload the contest
 *     display and battle display windows for the new move. Both are always loaded in
 *     memory, but only the currently active one is copied to VRAM. The exception to this

 *   - If the player confirms, go to MENU_STATE_FADE_AND_RETURN, and set VAR_0x8004 to FALSE.
 *   - If the player cancels, go to either MENU_STATE_SETUP_QUEST_DESC or
 *     MENU_STATE_SETUP_QUEST_REWARD.
 *
 * CB2_InitQuestMenuReturnFromSelectMove:
 *   - Do most of the same stuff as CB2_InitQuestMenu.
 * DoQuestMenuMain: MENU_STATE_FADE_FROM_SUMMARY_SCREEN
 * DoQuestMenuMain: MENU_STATE_TRY_OVERWRITE_MOVE
 *   - If any of the pokemon's existing moves were chosen, overwrite the move and
 *     go to MENU_STATE_DOUBLE_FANFARE_FORGOT_MOVE and set VAR_0x8004 to TRUE.
 *   - If the chosen move is the one the player selected before the summary screen,
 *     go to MENU_STATE_PRINT_STOP_TEACHING.
 *
 */

#define MENU_STATE_FADE_TO_BLACK 0
#define MENU_STATE_WAIT_FOR_FADE 1
#define MENU_STATE_UNREACHABLE 2
#define MENU_STATE_SETUP_QUEST_DESC 3
#define MENU_STATE_IDLE_BATTLE_MODE 4
#define MENU_STATE_SETUP_QUEST_REWARD 5
#define MENU_STATE_IDLE_CONTEST_MODE 6
// State 7 is skipped.
#define MENU_STATE_PRINT_PIN_QUEST_PROMPT 8
#define MENU_STATE_PIN_QUEST_CONFIRM 9
// States 10 and 11 are skipped.
#define MENU_STATE_PRINT_GIVE_UP_PROMPT 12
#define MENU_STATE_GIVE_UP_CONFIRM 13
#define MENU_STATE_FADE_AND_RETURN 14
#define MENU_STATE_RETURN_TO_FIELD 15
#define MENU_STATE_PRINT_TRYING_TO_LEARN_PROMPT 16
#define MENU_STATE_WAIT_FOR_TRYING_TO_LEARN 17
#define MENU_STATE_CONFIRM_DELETE_OLD_MOVE 18
#define MENU_STATE_PRINT_WHICH_MOVE_PROMPT 19
#define MENU_STATE_SHOW_MOVE_SUMMARY_SCREEN 20
// States 21, 22, and 23 are skipped.
#define MENU_STATE_PRINT_STOP_TEACHING 24
#define MENU_STATE_WAIT_FOR_STOP_TEACHING 25
#define MENU_STATE_CONFIRM_STOP_TEACHING 26
#define MENU_STATE_CHOOSE_SETUP_STATE 27
#define MENU_STATE_FADE_FROM_SUMMARY_SCREEN 28
#define MENU_STATE_TRY_OVERWRITE_MOVE 29
#define MENU_STATE_DOUBLE_FANFARE_FORGOT_MOVE 30
#define MENU_STATE_PRINT_TEXT_THEN_FANFARE 31
#define MENU_STATE_WAIT_FOR_FANFARE 32
#define MENU_STATE_WAIT_FOR_A_BUTTON 33

// The different versions of hearts are selected using animation
// commands.
#define APPEAL_HEART_EMPTY 0
#define APPEAL_HEART_FULL 1
#define JAM_HEART_EMPTY 2
#define JAM_HEART_FULL 3

#define MENU_PAGE_OVERVIEW 0
#define MENU_PAGE_PINNED_QUESTS 1
#define MENU_PAGE_ACTIVE_QUESTS 2
#define MENU_PAGE_INACTIVE_QUESTS 3
#define MENU_PAGE_COMPLETED_QUESTS 4
#define MENU_PAGE_TODO_QUESTS 5
#define MENU_PAGE_REPEATABLE_QUESTS 6
#define MENU_PAGE_NEW_QUESTS 7

#define MAX_QUESTS_TO_SHOW (QUEST_COUNT)

extern const u8 gText_QuestLogBack[];
extern const u8 gText_QuestLogTitleOverview[];
extern const u8 gText_QuestLogTitlePinned[];
extern const u8 gText_QuestLogTitleActive[];
extern const u8 gText_QuestLogTitleInactive[];
extern const u8 gText_QuestLogTitleComplete[];
extern const u8 gText_QuestLogTitleTodo[];
extern const u8 gText_QuestLogTitleRepeatable[];
extern const u8 gText_QuestLogTitleNew[];

extern const u8 gText_QuestLogPromptOverview[];
extern const u8 gText_QuestLogPromptCategory[];
extern const u8 gText_QuestLogPromptPinQuest[];
extern const u8 gText_QuestLogPromptUnpinQuest[];

static EWRAM_DATA struct
{
    u8 state;
    u8 currentPage;
    u8 pinSpriteIds[2];                               /*0x001*/
    u16 optionsToDisplay[MAX_QUESTS_TO_SHOW];               /*0x01A*/
    u8 partyMon;                                         /*0x044*/
    u8 moveSlot;                                         /*0x045*/
    struct ListMenuItem menuItems[MAX_QUESTS_TO_SHOW];  /*0x0E8*/
    u8 numMenuChoices;                                   /*0x110*/
    u8 numToShowAtOnce;                                  /*0x111*/
    u8 listMenuTask;                                     /*0x112*/
    u8 moveListScrollArrowTask;                          /*0x113*/
    u8 moveDisplayArrowTask;                             /*0x114*/
    u16 scrollOffset;                                    /*0x116*/
} *sQuestMenuStruct = {0};

static EWRAM_DATA struct {
    u16 listOffset;
    u16 listRow;
    u16 prevListOffset;
    u16 prevListRow;
    bool8 showQuestRewards;
} sQuestMenuMenuSate = {0};



static const u8* const sQuestMenuPageTitles[] =
{
    [MENU_PAGE_OVERVIEW] = gText_QuestLogTitleOverview,
    [MENU_PAGE_PINNED_QUESTS] = gText_QuestLogTitlePinned,
    [MENU_PAGE_ACTIVE_QUESTS] = gText_QuestLogTitleActive,
    [MENU_PAGE_INACTIVE_QUESTS] = gText_QuestLogTitleInactive,
    [MENU_PAGE_COMPLETED_QUESTS] = gText_QuestLogTitleComplete,
    [MENU_PAGE_TODO_QUESTS] = gText_QuestLogTitleTodo,
    [MENU_PAGE_REPEATABLE_QUESTS] = gText_QuestLogTitleRepeatable,
    [MENU_PAGE_NEW_QUESTS] = gText_QuestLogTitleNew,
};

static const u16 sQuestMenuPaletteData[] = INCBIN_U16("graphics/interface/ui_learn_move.gbapal");

// The arrow sprites in this spritesheet aren't used. The scroll-arrow system provides its own
